app/views/allergens/index.html.erb

    <% @allergens = Allergen.all %>
    <%= render partial: "shared/allergen", collection: Allergen.all, :locals => {:index_view => true, :search_item => ""}  %>
---
SELECT "allergens".* FROM "allergens"