app/controllers/allergens_controller.rb

  def index
    # Allergens.all accesses model layer and stores result in an instance variable
    # which is passed to the view
    @allergens = Allergen.all
---
SELECT "allergens".* FROM "allergens"

  def create
    # the form displayed in "new.html.erb" is submitted to action='/allergens'
    # using verb method="post" which is routed to allergens#create.
    # @allergen, is populated with values (params) submitted from the form
    @allergen = Allergen.new(allergen_params)

    if @allergen.save #returns "false" if it can't save
---
INSERT INTO "allergens" ("category", "substances", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category", "Peroxide"], ["substances", "peroxide; "], ["created_at", "2022-12-28 20:53:33.634471"], ["updated_at", "2022-12-28 20:53:33.634471"]]

  def destroy
    # already have @allergen at this point because 'set_allergen' was invoked
    @allergen.destroy
---
DELETE FROM "allergens" WHERE "allergens"."id" = $1  [["id", 14]]

  def set_allergen
    # ask ActiveRecord to find the Allergen object in the db using
    # contains an integer ie: "12" or category ie: "Disperse Orange"
    !!params[:id].match(/^(\d)+$/) ?
      (@allergen = Allergen.find_by id: params[:id]) :
---
SELECT "allergens".* FROM "allergens" WHERE "allergens"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]