app/controllers/products_controller.rb

  def create
  # the form displayed in "new.html.erb" is submitted to action='/products'
  # using verb method="post" which is routed to products#create.
  # @product, is populated with values (params) submitted from the form
    @product = Product.new(product_params)
    if @product.save # @product.save returns "false" if it can't save
---
INSERT INTO "products" ("name", "ingredients", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update # this is where the form displayed in 'edit' is submitted using verb "patch"
    if @product.update(product_params)
---
UPDATE "products" SET "ingredients" = $1, "updated_at" = $2 WHERE "products"."id" = $3

  def set_product
    # ask ActiveRecord to find the Product object in the db using the id from params
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]