app/models/allergen.rb

SELECT "allergens".* FROM "allergens" ORDER BY "allergens"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def matching_substances_to(ingredient)
    matching_substances = []
    # does ingredient match any substance in this allergen category
    matching_substances = self.get_substances.select {|substance|