app/models/product.rb

SELECT 1 AS one FROM "reactions" WHERE "reactions"."product_id" = $1 LIMIT $2  [["product_id", 28], ["LIMIT", 1]]
SELECT 1 AS one FROM "reactions" WHERE "reactions"."product_id" = $1 LIMIT $2  [["product_id", 86], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "products".* FROM "products"
SELECT "allergens".* FROM "allergens" ORDER BY "allergens"."id" ASC LIMIT $1  [["LIMIT", 1000]]
INSERT INTO "reactions" ("allergen_id", "product_id", "reactive_substances", "reactive_ingredient", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "reactions".* FROM "reactions" WHERE "reactions"."product_id" = $1  [["product_id", 29]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 85]]
DELETE FROM "reactions" WHERE "reactions"."id" = $1  [["id", 153]]
---
  def get_ingredients

    # split ingredients using ', ' or newline or '/' so abc/def is abc def
    ingredient_array = ingredients.split(/\, |\n|\//)

    # get rid of all duplicate whitespaces and characters that are not: a-z A-Z 0-9 - [] () '
    ingredient_array.map! do |ingredient|
      unless ingredient.empty?
        ingredient.split(" ").join(" ").gsub(%r{[^a-zA-Z0-9\-\[\]\,\'\(\)\s]}, '')
      end
    end

    # ingredient array shouldn't have any nill or all whitespace entries
    clean_array = ingredient_array.delete_if { |ingredient| ingredient.blank?}

    #x=1/0
    return clean_array
  end

  def causes_reaction
    if Reaction.exists?(product_id: self.id)
      return Reaction.where("product_id = ?", self.id)
    else
      return []
    end
  end

  def check_for_allergens
    allergens = Allergen.all
    # test each ingredient in product
    self.get_ingredients.each do |ingredient|
      reactive_substances = []
      # against each allergen category
      allergens.find_each do |allergen|
        # check for substances that match this ingredient in this categor
        reactive_substances = allergen.matching_substances_to(ingredient)
        #x=1/0
        if reactive_substances.any? # add information to the Reaction db
          # Create a new entry in Reaction db for this product
          Reaction.create(product_id: self.id,
          allergen_id: allergen.id,
          reactive_substances: reactive_substances.join(', '),
          reactive_ingredient: ingredient.upcase)
        end
      end
    end
    #x=1/0
  end

  before_create do
    #Start with an empty db, there will never be more than 1 product in db
    Product.destroy_all
  end

  after_save do
    # Start with an empty Reaction DB,
    # then check and save reactions after saving product
    Reaction.destroy_all