app/models/product.rb

SELECT "allergens".* FROM "allergens" ORDER BY "allergens"."id" ASC LIMIT $1  [["LIMIT", 1000]]
INSERT INTO "reactions" ("allergen_id", "product_id", "reactive_substances", "reactive_ingredient", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 3]]
DELETE FROM "reactions" WHERE "reactions"."id" = $1  [["id", 4]]
---
  def check_for_allergens
    allergens = Allergen.all
    # test each ingredient in product
    self.get_ingredients.each do |ingredient|
      reactive_substances = []
      # against each allergen category
      allergens.find_each do |allergen|
        # check for substances that match this ingredient in this categor
        reactive_substances = allergen.matching_substances_to(ingredient)
        if reactive_substances.any? # add information to the Reaction db
          # Create a new entry in Reaction db for this product
          Reaction.create(product_id: self.id,
          allergen_id: allergen.id,
          reactive_substances: reactive_substances.join(', '),
          reactive_ingredient: ingredient.upcase)
        end
      end
    end
  end

  before_create do
    #Start with an empty db, there will never be more than 1 product in db
    Product.destroy_all
  end

  after_save do
    # Start with an empty Reaction DB,
    # then check and save reactions after saving product
    Reaction.destroy_all