app/views/products/show.html.erb

  <!-- Heading: Check if product's ingredients cause an allergic reaction -->
  <% if @product.causes_reaction.empty? %>
---
SELECT 1 AS one FROM "reactions" WHERE (product_id = 22) LIMIT $1  [["LIMIT", 1]]